In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Turn your project folder path into a string as outlined in the Exercise text.
path = r'/Users/peterreadman/Desktop/Python Projects/CareerFoundry/04-2020 Instacart Basket Analysis/'

In this next step, you’re going to be adding some new data to your Instacart orders dataframe. You’ve probably noticed by now that your df_ords and df_prods dataframes don’t contain a common column. How, then, are you supposed to combine them? To solve this problem, you’ll combine your df_ords dataframe with a new dataframe called order_products_prior. This dataframe contains a “product_id” column—the same as your df_prods dataframe. By adding this column to your df_ords dataframe, you’ll have created a common column between df_ords and df_prods, paving the way for a successful merge

In [3]:
# import orders_products_prior.csv data set
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', '02a Original Data', 'order_products_prior.csv'), index_col = False)

In [4]:
# Check the dimensions of the imported dataframe.

df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [5]:
df_ords_prior.shape

(32434489, 4)

In [4]:
# import latest 'orders' data set 
df_ords = pd.read_csv(os.path.join(path, '02 Data', '02b Prepared Data', 'orders_checked.csv'), index_col = False)

In [5]:
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_last_order
0,0,0,2539329,1,1,2,8,NaN
1,1,1,2398795,1,2,3,7,15.0
2,2,2,473747,1,3,3,12,21.0
3,3,3,2254736,1,4,4,7,29.0
4,4,4,431534,1,5,4,15,28.0

In [8]:
df_ords.drop('Unnamed: 0.1', axis=1, inplace=True)

In [9]:
df_ords.drop('Unnamed: 0', axis=1, inplace=True)

In [10]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [11]:
df_ords_prior.shape

(32434489, 4)

In [12]:
df_ords.shape

(3421083, 6)

In [13]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [14]:
# merge on order_id 

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [15]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [16]:
# Using the value_counts() function lets you quickly sum up all the values in the “_merge” column,
# letting you see instantly whether you have a full match or not

df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [22]:
df_merged_large.shape

(32434489, 10)

In [21]:
# Export the merged file in pickle format as “orders_products_combined.pkl”

df_merged_large.to_pickle(os.path.join(path, '02 Data', '02b Prepared Data', 'orders_products_combined.pkl'))